package com.liver_cloud.wechat.common;

/**
 * eyun错误日志枚举
 */
public enum EnumErrorCode {



	/**
	 * 一切正常
	 */
	CODE_000000("ok","000000", "一切正常","一切正常"),
	/**
	 * 服务器异常（运营商）
	 */
	CODE_000001("000001", "服务器异常"),
	/**
	 * 服务器无响应（本服务器）
	 */
	CODE_000002("000002", "服务器无响应"),
	/**
	 * 初始日历字典失败
	 */
	CODE_000003("000003", "初始日历字典失败"),
	/**
	 * 获取日历失败
	 */
	CODE_000004("000004", "获取日历失败"),
	/**
	 * 获取用户用户名失败
	 */
	CODE_000005("000005", "获取用户用户名失败"),
	/**
	 * 获取用户信息失败
	 */
	CODE_000006("000006", "获取用户信息失败"),
	/**
	 * 获取用户首页信息失败
	 */
	CODE_000007("000007", "获取用户首页信息失败"),
	/**
	 * 添加格子天气信息失败
	 */
	CODE_000008("000008", "添加格子天气信息失败"),
	/**
	 * 修改格子天气信息失败
	 */
	CODE_000009("000009", "修改格子天气信息失败"),
	/**
	 * 增加格子日记信息失败
	 */
	CODE_000010("000010", "增加格子日记信息失败"),
	/**
	 * 修改格子日记信息失败
	 */
	CODE_000011("000011", "修改格子日记信息失败"),
	/**
	 * 短信验证码发送成功
	 */
	CODE_000012("000012", "短信验证码发送成功"),
	/**
	 * 短信验证码发送失败
	 */
	CODE_000013("000013", "短信验证码发送失败"),
	/**
	 * 短信验证码无效
	 */
	CODE_000014("000014", "短信验证码无效"),
	/**
	 * 获取微信登陆申请参数失败
	 */
	CODE_000015("000015", "获取微信登陆申请参数失败"),
	/**
	 * 绑定手机号失败
	 */
	CODE_000016("000016", "绑定手机号失败"),
	/**
	 * 完善用户收货地址信息失败
	 */
	CODE_000017("000017", "完善用户收货地址信息失败"),
	/**
	 * 获取格子信息失败
	 */
	CODE_000018("000018", "获取格子信息失败"),
	/**
	 *请先绑定手机号
	 */
	CODE_000019("000019", "请先绑定手机号"),
	/**
	 * 转出金额必须小于红包余额
	 */
	CODE_000020("000020", "转出金额必须小于红包余额"),
	/**
	 * 两次密码不一致
	 */
	CODE_000021("000021", "两次密码不一致"),
	/**
	 * 提现到app失败，请稍后再试
	 */
	CODE_000022("000022", "提现到app失败，请稍后再试"),
	/**
	 * 提现金额必须大于0
	 */
	CODE_000023("000023", "提现金额必须大于0"),
	/**
	 * 获取用户是否已注册app失败
	 */
	CODE_000024("000024", "获取用户是否已app注册失败"),
	/**
	 * 获取时间轴失败
	 */
	CODE_000025("000025", "获取时间轴失败"),
	/**
	 * 获取奖品信息失败
	 */
	CODE_000026("000026", "获取奖品信息失败"),
	/**
	 * 保存图片上传信息失败
	 */
	CODE_000027("000027", "保存图片上传信息失败"),
	/**
	 * 获取模板信息失败
	 */
	CODE_000028("000028", "获取模板信息失败"),
	/**
	 * 获取用户某天模板失败
	 */
	CODE_000029("000029", "获取用户某天模板失败"),
	/**
	 * 增加用户模板关系失败
	 */
	CODE_000030("000030", "增加用户模板关系失败"),
	/**
	 * 访问类型不能
	 */
	CODE_000038("000038", "增加用户模板关系失败"),
	/**
	 * 获取用户时间轴失败
	 */
	CODE_000031("000031", "获取用户时间轴失败"),
	/**
	 * 用户名不能为空
	 */
	CODE_000032("000032", "用户名不能为空"),
	/**
	 * 添加组件action失败
	 */
	CODE_000033("000033", "添加组件action失败"),
	/**
	 * 添加组件类别失败
	 */
	CODE_000034("000034", "添加组件类别失败"),
	/**
	 * 添加组件模板失败
	 */
	CODE_000035("000035", "添加组件模板失败"),
	/**
	 * 获取组件类别失败
	 */
	CODE_000036("000036", "获取组件类别失败"),
	/**
	 * 删除用户组件失败
	 */
	CODE_000037("000037", " 删除用户组件失败"),
	/**
	 * 发起挑战活动失败
	 */
	CODE_000100("000100", "发起挑战活动失败"),
	/**
	 * 游戏不存在
	 */
	CODE_000101("000101", "游戏不存在"),
	/**
	 * 编辑游戏失败
	 */
	CODE_000102("000102", "编辑游戏失败"),
	/**
	 * 获取挑战信息失败
	 */
	CODE_000103("000103", "获取挑战信息失败"),
	/**
	 * 获取挑战留言信息失败
	 */
	CODE_000104("000104", "获取挑战留言信息失败"),
	/**
	 * 保存挑战留言信息失败
	 */
	CODE_000105("000105", "添加挑战留言信息失败"),
	/**
	 * 图片id不能为空
	 */
	CODE_000106("000106", "图片编号不能为空"),
	/**
	 * 保存图片失败
	 */
	CODE_000107("000107", "保存图片失败"),
	/**
	 * 获取图片路径失败
	 */
	CODE_000108("000108", "获取图片路径失败"),
	/**
	 * 删除图片失败
	 */
	CODE_000109("000109", "删除图片失败"),
	/**
	 * 获取我点赞的游戏失败
	 */
	CODE_000110("000110", "获取我点赞的游戏失败"),
	/**
	 * 点赞保存失败
	 */
	CODE_000111("000111", "点赞保存失败"),
	/**
	 * 实际完成卡路里为空
	 */
	CODE_000112("000112", "实际完成卡路里为空"),
	/**
	 * 上传挑战数据失败
	 */
	CODE_000113("000113", "上传挑战数据失败"),
	/**
	 * 获取挑战点赞信息失败
	 */
	CODE_000114("000114", "获取挑战点赞信息失败"),
	/**
	 * 活动已经结束
	 */
	CODE_000115("000115", "活动已经结束"),
	/**
	 * 未找到该游戏红包信息
	 */
	CODE_000116("000116", "未找到该游戏红包信息"),
	/**
	 * 该游戏抢红包时间已经结束
	 */
	CODE_000117("000117", "该游戏抢红包时间已经结束"),
	/**
	 * 已领取过
	 */
	CODE_000118("000118", "已领取过"),
	/**
	 * 红包已抢光
	 */
	CODE_000119("000119", "红包已抢光"),
	/**
	 * 抢红包失败
	 */
	CODE_000120("000120", "抢红包失败"),
	/**
	 * 交易金额不能为空
	 */
	CODE_000121("000121", "交易金额不能为空"),
	/**
	 * 黄金赞申请失败
	 */
	CODE_000122("000122", "黄金赞申请失败"),
	/**
	 * 发起时间不能小于当前时间
	 */
	CODE_000123("000123", "发起时间不能小于当前时间"),
	/**
	 * 同一天不能发起两次活动
	 */
	CODE_000124("000124", "同一天不能发起两次活动"),
	/**
	 * 不能为自己点赞
	 */
	CODE_000125("000125", "不能为自己点赞"),
	/**
	 * 不能重复点赞
	 */
	CODE_000126("000126", "不能重复点赞"),
	/**
	 * 保存成功，由于没有保证金和点黄金赞的人，不能发红包
	 */
	CODE_000127("000127", "保存成功，由于没有保证金和点黄金赞的人，不能发红包"),
	/**
	 * 已领取
	 */
	CODE_000128("000128", "已领取"),
	/**
	 * 获取大家抢红包信息失败
	 */
	CODE_000129("000129", "获取大家抢红包信息失败"),
	/**
	 * 获取用户是否点过黄金赞失败
	 */
	CODE_000130("000130", "获取用户是否点过黄金赞失败"),
	/**
	 *请在活动当日上传任务
	 */
	CODE_000131("000131", "请在活动当日上传任务"),
	/**
	 * gameId为空
	 */
	CODE_000132("000132", "gameId为空"),
	/**
	 * 您的账户余额不足，请使用微信支付
	 */
	CODE_000133("000133", "您的账户余额不足，请使用微信支付"),
	/**
	 * 余额支付失败
	 */
	CODE_000134("000134", "余额支付失败"),
	/**
	 * 手机号已被注册
	 */
	CODE_000135("000135", "手机号已被注册", "手机号已被注册"),
	/**
	 * 手机号已被注册
	 */
	CODE_000136("000136", "手机号尚未注册", "手机号尚未注册"),
	/**
	 * 密码不正确
	 */
	CODE_000137("000137", "密码不正确", "密码不正确"),
	/**
	 *
	 */
	CODE_000138("000138", "该手机号已经绑定过微信，请先解绑", "该手机号已经绑定过微信，请先解绑"),
	/**
	 *
	 */
	CODE_000139("000139", "该微信已经绑定过eyun账号，请先解绑", "该微信已经绑定过eyun账号，请先解绑"),
	/**
	 * 注册失败
	 */
	CODE_000140("000140", "注册失败", "注册失败"),
	/**
	 * 登录失败
	 */
	CODE_000141("000141", "登录失败", "登录失败"),
	/**
	 * 关联失败
	 */
	CODE_000142("000142", "关联失败", "关联失败"),
	/**
	 * 账号异常，数据库中有微信号但是没有手机号
	 */
	CODE_000143("000143", "账号异常", "账号异常"),
	/**
	 * 上传文件大小超出限制
	 */
	CODE_000144("000144", "上传文件大小超出限制", "上传文件大小超出限制"),
	/**
	 * 文件上传失败
	 */
	CODE_000145("000145", "文件上传失败", "文件上传失败"),
	/**
	 * "游戏已开始，不能再进行投注
	 */
	CODE_000146("000146", "比赛已开始，不能再进行投注", "比赛已开始，不能再进行投注"),
	/**
	 * 不能重复投注一场比赛
	 */
	CODE_000147("000147", "不能重复投注一场比赛", "不能重复投注一场比赛"),
	/**
	 * 请求异常
	 */
	CODE_000400("000400", "请求异常"),
	/**
	 * 服务器异常
	 */
	CODE_000500("000500", "服务器异常"),
	/**
	 * 服务器超时
	 */
	CODE_000503("000503", "服务器超时");

	public String result;
	public String code;
	public String msg;
	public String value;

	EnumErrorCode(String code, String msg) {
		this.result="error";
		this.code = code;
		this.msg = msg;
	}

	EnumErrorCode(String code, String msg,String value) {
		this.result="error";
		this.code = code;
		this.msg = msg;
		this.value = value;
	}

	/**
	 * 一切正常调用的构造方法
	 */
	EnumErrorCode(String result,String code, String msg,String value) {
		this.result=result;
		this.code = code;
		this.msg = msg;
		this.value = value;
	}
}
