package com.liver_cloud.util;

/**
 * eyun错误日志枚举
 */
public enum EnumErrorCode {



	/**
	 * 一切正常
	 */
	CODE_000000("000000", "一切正常"),
	/**
	 * 服务器异常（运营商）
	 */
	CODE_000001("000001", "服务器异常"),
	/**
	 * 服务器无响应（本服务器）
	 */
	CODE_000002("000002", "服务器无响应"),
	/**
	 * 获取用户信息失败
	 */
	CODE_000003("000003", "获取用户信息失败"),
	/**
	 * 更新用户信息失败
	 */
	CODE_000010("000010", "生成参赛二维码失败失败"),
	/**
	 * 删除用户信息失败
	 */
	CODE_000012("000012", "报名人数已满"),
	/**
	 * 添加用户信息失败
	 */
	CODE_000011("000011", "报名失败"),
	/**
	 * 获取参赛者信息失败
	 */
	CODE_000013("000013", "获取参赛者信息失败"),
	/**
	 * 参赛者人数不够
	 */
	CODE_000014("000014", "参赛者人数不够"),
	/**
	 * 获取支持人数失败
	 */
	CODE_000015("000015", "获取支持人数失败"),
	/**
	 * 查询用户信息失败
	 */
	CODE_000016("000016", "游戏开始失败"),
	/**
	 * 查询用户信息失败
	 */
	CODE_000017("000017", "游戏取消失败"),
	/**
	 * 查询用户信息失败
	 */
	CODE_000018("000018", "胜负设置失败"),
	/**
	 * 查询失败
	 */
	CODE_000022("000022", "暂无活动"),
	/**
	 * 查询失败
	 */
	CODE_000023("000023", "查询失败"),
	
	/**
	 * 查询用户信息失败
	 */
	CODE_000024("000024", "请先开始游戏"),	
	
	/**
	 * 裁判尚未注册
	 */
	CODE_000025("000025", "尚未注册"),
	
	/**
	 * 密码为空
	 */
	CODE_000026("000026", "密码为空"),
	
	/**
	 * 用户名或密码错误
	 */
	CODE_000027("000027", "用户名或密码错误"),
	
	/**
	 * 短信验证码发送成功
	 */
	CODE_000028("000028", "短信验证码发送成功"),
	
	/**
	 * 短信验证码发送失败
	 */
	CODE_000029("000029", "短信验证码发送失败"),
 
	/**
	 * 短信验证码无效
	 */
	CODE_000030("000030", "短信验证码无效"),
	/**
	 * 登陆失败
	 */
	CODE_000031("000031", "登陆失败"),
	
	/**
	 *验证码校验失败
	 */
	CODE_000032("000032", "验证码校验失败"),
	
	/**
	 *修改密码失败
	 */
	CODE_000033("000033", "修改密码失败"),
	
	/**
	 *预约报名失败
	 */
	CODE_000034("000034", "预约报名失败"),
	/**
	 *添加活动失败
	 */
	CODE_000035("000035", "添加活动失败"),
	
	/**
	 *两次输入不一致
	 */
	CODE_000036("000036", "两次输入不一致"),

	/**
	 *添加举办活动日期失败
	 */
	CODE_000037("000037", "商家ID或日期为空"),
	/**
	 *今天已报名
	 */
	CODE_000038("000038", "今天已报名"),
	;

	public String result;
	public String code;
	public String msg;
	public String value;

	EnumErrorCode(String code, String msg) {
		this.result="error";
		this.code = code;
		this.msg = msg;
	}

	EnumErrorCode(String code, String msg,String value) {
		this.result="error";
		this.code = code;
		this.msg = msg;
		this.value = value;
	}

	/**
	 * 一切正常调用的构造方法
	 */
	EnumErrorCode(String result,String code, String msg,String value) {
		this.result=result;
		this.code = code;
		this.msg = msg;
		this.value = value;
	}
}
